In [1]:
import pandas as pd

In [2]:
data=pd.read_csv("data/titanic.csv")

In [3]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [13]:
data.Embarked.unique()  #Port of Embarkation - (C = Cherbourg, Q = Queenstown, S = Southampton)

array(['S', 'C', 'Q'], dtype=object)

In [14]:
data.shape

(891, 12)

In [15]:
data.isna().sum()/data.shape[0]

PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.000000
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Cabin          0.771044
Embarked       0.000000
dtype: float64

In [16]:
data.shape

(891, 12)

In [7]:
data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [8]:
data.groupby('Survived').count()['PassengerId']

Survived
0    549
1    342
Name: PassengerId, dtype: int64

In [9]:
data['Age'].mean()

29.69911764705882

In [10]:
data['Age'] = data['Age'].fillna(data['Age'].mean())

In [11]:
data['Embarked'] = data['Embarked'].fillna(data['Embarked'].mode()[0])

In [17]:
X=data.drop(['PassengerId','Name','Ticket','Cabin','Survived'],axis=1)
y=data['Survived']

In [18]:
X.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  22.0      1      0   7.2500        S
1       1  female  38.0      1      0  71.2833        C
2       3  female  26.0      0      0   7.9250        S
3       1  female  35.0      1      0  53.1000        S
4       3    male  35.0      0      0   8.0500        S

In [19]:
X['Pclass']=X['Pclass'].map({1:'upper',2:'middle',3:'lower'})

In [20]:
X.head()

  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0  lower    male  22.0      1      0   7.2500        S
1  upper  female  38.0      1      0  71.2833        C
2  lower  female  26.0      0      0   7.9250        S
3  upper  female  35.0      1      0  53.1000        S
4  lower    male  35.0      0      0   8.0500        S

In [21]:
X = pd.get_dummies(X,drop_first=True)

In [22]:
X

,Age,SibSp,Parch,Fare,Pclass_middle,Pclass_upper,Sex_male,Embarked_Q,Embarked_S
0,22.000000,1,0,7.2500,0,0,1,0,1
1,38.000000,1,0,71.2833,0,1,0,0,0
2,26.000000,0,0,7.9250,0,0,0,0,1
3,35.000000,1,0,53.1000,0,1,0,0,1
4,35.000000,0,0,8.0500,0,0,1,0,1
...,...,...,...,...,...,...,...,...,...
886,27.000000,0,0,13.0000,1,0,1,0,1
887,19.000000,0,0,30.0000,0,1,0,0,1
888,29.699118,1,2,23.4500,0,0,0,0,1
889,26.000000,0,0,30.0000,0,1,1,0,0
890,32.000000,0,0,7.7500,0,0,1,1,0

In [23]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.33,random_state=42) #0.67 data will be for training.

In [24]:
#import Random Forest Classifier from sklearn.ensemble

from sklearn.model_selection import GridSearchCV #GridSearchCV is for parameter tuning
from sklearn.ensemble import RandomForestClassifier
cls=RandomForestClassifier()

In [25]:
?RandomForestClassifier

In [26]:
n_estimators=[25,50,75,100] #number of decision trees in the forest, default = 100
criterion=['gini','entropy'] #criteria for choosing nodes default = 'gini'
max_depth=[3,5,10] #maximum number of nodes in a tree default = None (it will go till all possible nodes)
parameters={'n_estimators': n_estimators,'criterion':criterion,'max_depth':max_depth} #this will undergo 4*2*3 = 24 iterations
RFC_cls = GridSearchCV(cls, parameters)
RFC_cls.fit(X_train,y_train)

GridSearchCV(estimator=RandomForestClassifier(),
             param_grid={'criterion': ['gini', 'entropy'],
                         'max_depth': [3, 5, 10],
                         'n_estimators': [25, 50, 75, 100]})

In [29]:
n_estimators=[70,72,74,76,78,80] #number of decision trees in the forest, default = 100
criterion=['entropy'] #criteria for choosing nodes default = 'gini'
max_depth=[5] #maximum number of nodes in a tree default = None (it will go till all possible nodes)
parameters={'n_estimators': n_estimators,'criterion':criterion,'max_depth':max_depth} #this will undergo 4*2*3 = 24 iterations
RFC_cls = GridSearchCV(cls, parameters)
RFC_cls.fit(X_train,y_train)

GridSearchCV(estimator=RandomForestClassifier(),
             param_grid={'criterion': ['entropy'], 'max_depth': [5],
                         'n_estimators': [70, 72, 74, 76, 78, 80]})

In [30]:
#to get the best parameter for the model
RFC_cls.best_params_

{'criterion': 'entropy', 'max_depth': 5, 'n_estimators': 80}

In [31]:
from sklearn.ensemble import RandomForestClassifier
cls=RandomForestClassifier(n_estimators=80,criterion='entropy',max_depth=5)

In [32]:
cls.fit(X_train,y_train)

RandomForestClassifier(criterion='entropy', max_depth=5, n_estimators=80)

In [33]:
y_pred=cls.predict(X_test)

In [34]:
#confusison matrix
from sklearn.metrics import confusion_matrix
confusion_matrix(y_test,y_pred)

array([[161,  14],
       [ 39,  81]])

In [35]:
#accuracy
from sklearn.metrics import accuracy_score
accuracy_score(y_test,y_pred)

0.8203389830508474

In [36]:
#Training Accuracy
y_train_pred = cls.predict(X_train)
accuracy_score(y_train,y_train_pred)

0.8557046979865772

In [33]:
#END